const __base__path__ = 'example/study163/1212491801';
const __base__name__ = __base__path__.split('/').map(d => d.replace(/^\w/, c => c.toUpperCase())).join('-');

const modules = import.meta.glob([
    `../../../views/example/study163/1212491801/**/*.vue`
]);

const setChildren = (data, parent) => {
    return data.map((d) => {
        let [ name, title, description, children ] = d;
        if (parent) {
            name = `${ parent }/${ name }`;
        }
        let route = {
            path: `/${ __base__path__ }/${ name }`,
            name: `${ __base__name__ }-${ name }`,
            meta: {
                title, description
            }
        };
        if (children) {
            route.redirect = { name: 'Home' };
            route.children = setChildren(children, name);
        } else {
            route.component = modules[ `../../../views/${ __base__path__ }/${ name }.vue` ];
        }
        return route;
    });
};

const __children__ = [
    [ '1', '一 开发环境搭建', '认识Three.js与开发环境搭建',
        [
            [ '1.5', '1.5 Vue应用', 'Three.js结合Vue开发' ]
        ]
    ],
    [ '2', '二 基础入门', '开发入门与调试设置',
        [
            [ '2.1', '2.1 轨道控制', '坐标辅助与轨道控制' ],
            [ '2.2', '2.2 元素关系', '物体位移与父子元素' ],
            [ '2.3', '2.3 缩放与旋转', '物体缩放与旋转' ],
            [ '2.4', '2.4 画布全屏', '响应式画布与全屏控制' ],
            [ '2.5', '2.5 lil-GUI', '应用lil-GUI调试' ],
            [ '2.6', '2.6 几何体', '几何体 / 顶点 / 索引 / 面 / BufferGeometry' ],
            [ '2.7', '2.7 材质', '几何体划分顶点组设置不同材质' ],
            [ '2.10', '2.10 贴图', '贴图的加载 / AO环境遮蔽贴图强度设置' ],
            [ '2.11', '2.11 光源', '透明贴图 / 环境贴图加载 / 高光贴图配合使用' ],
            [ '2.12', '2.12 颜色空间', '纹理的颜色空间' ],
            [ '2.13', '2.13 雾', '场景的线型雾和指数雾' ],
            [ '2.14', '2.14 模型', '加载gltf模型与加载压缩过的模型' ],
            [ '2.15', '2.15 事件', '光线投射实现3D场景交互事件' ],
            [ '2.16', '2.16 Tween动画', '补间动画Tween应用' ]
        ]
    ],
    [ '3', '三 几何体', 'Geometry几何体进阶详解',
        [
            [ '3.1', '3.1 UV贴图', '全面讲解UV与应用' ],
            [ '3.2', '3.2 法向量属性', '法向量属性应用于法向量辅助器' ],
            [ '3.3', '3.3 顶点', '几何体顶点转换 / 位移 / 旋转 / 缩放' ],
            [ '3.4', '3.4 包围盒', '包围盒的使用与世界矩阵转换' ],
            [ '3.5', '3.5 居中与中心', '几何体居中与获取几何体中心' ],
            [ '3.6', '3.6 多物体包围盒', '获取多个物体包围盒' ],
            [ '3.7', '3.7 边缘几何体', '边缘几何体与线框几何体' ]
        ]
    ],
    [ '4', '四 材质', '材质与纹理详解',
        [
            [ '4.1', '4.1 MatCap材质捕捉', 'MatCap材质捕捉原理与应用' ],
            [ '4.3', '4.3 Phong镜面高光材质', 'Phong材质镜面高光材质应用' ],
            [ '4.4', '4.4 Phong玻璃水晶', 'Phong材质玻璃水晶效果' ],
            [ '4.5', '4.5 Standard标准材质', 'Standard标准材质精讲, 凹凸 / 置换 / 环境遮蔽 / 法向' ],
            [ '4.7', '4.7 Physical物理材质', 'Physical物理材质透明物体的通透性 / 厚度 / 衰减颜色 / 衰减距离' ],
            [ '4.8', '4.8 Physical透明物', '透明物体的折射率和反射率' ],
            [ '4.9', '4.9 Physical清漆', '清漆效果与清漆粗糙度 / 清漆法向 / 清漆相关贴图' ],
            [ '4.10', '4.10 Physical布料与织物', '布料和织物材料的光泽效果' ],
            [ '4.11', '4.11 Physical虹彩效应', '肥皂泡 / 油滴 / 蝴蝶翅膀等薄膜的虹彩效应' ],
            [ '4.12', '4.12 清除物体', '清除几何体 / 材质 / 纹理, 保证性能和内存不泄露' ],
            [ '4.14', '4.14 物理材质设置', '编辑器设置材质效果导出物体' ],
            [ '4.15', '4.15 物理发光属性', '物理法光属性逼真产品' ],
            [ '4.17', '4.17 控制器限制', '限制控制器位移 / 旋转角度' ]
        ]
    ],
    [ '5', '五 纹理', '纹理材质高级操作',
        [
            [ '5.1', '5.1 纹理操作', '纹理的中心 / 偏移 / 旋转 / 重复' ],
            [ '5.2', '5.2 纹理操作', '纹理的纵向翻转 / 与预乘alpha生成颜色' ],
            [ '5.3', '5.3 纹理映射', '纹理放大过滤 / 缩小过滤' ],
            [ '5.4', '5.4 mipmap', 'mipmap解决摩尔纹条纹' ],
            [ '5.5', '5.5 anisotropy', '各项异性anisotropy倾斜模糊问题' ],
            [ '5.8', '5.8 KTX2纹理', 'KTX2 / DDS / TGA纹理' ],
            [ '5.9', '5.9 映射和曝光', '设置高动态范围全景背景色调映射和色调曝光' ]
        ]
    ],
    [ '6', '六 动画 / 灯光 / 阴影', '详解灯光与阴影',
        [
            [ '6.1', '6.1 Gsap动画', 'Gsap动画库基本使用与原理' ],
            [ '6.2', '6.2 Gsap控制', 'Gsap控制动画属性与方法' ],
            [ '6.3', '6.3 灯光与阴影', '灯光与阴影详解' ],
            [ '6.4', '6.4 平行光', '直线光与阴影详细设置' ],
            [ '6.5', '6.5 聚光灯', '聚光灯各属性详解' ],
            [ '6.6', '6.6 点光源', '点光源各属性详解' ],
            [ '6.7', '6.7 阴影常见问题', '阴影作用透明度纹理与阴影常见问题' ],
            [ '6.8', '6.8 动态级联阴影', '大场景动态级联阴影设置' ]
        ]
    ],
    [ '7', '七 操控物体', '操控物体实现家居编辑器',
        [
            [ '7.1', '7.1 基础设置', '基础设置与物体添加列表' ],
            [ '7.2', '7.2 变换控制器', '使用变换控制器操控物体' ],
            [ '7.3', '7.3 切换控制', '家具列表与控制物体切换' ],
            [ '7.4', '7.4 变换控制', '变换控制器对物体进行位移 / 旋转 / 缩放' ],
            [ '7.5', '7.5 变换控制坐标空间', '变换控制器按照本地与世界坐标控制' ],
            [ '7.6', '7.6 变换操作步长', '固定位移缩放旋转的步长' ],
            [ '7.7', '7.7 吸附与灯光', '吸附地面与室内灯光开关' ]
        ]
    ],
    [ '8', '八 3D动画', '3D动画系统详解',
        [
            [ '8.1', '8.1 原理与应用', '动画原理与应用' ],
            [ '8.2', '8.2 向量关键帧', 'three.js设置keyframe关键帧实现动画' ],
            [ '8.3', '8.3 四元关键帧', '四元数与欧拉角转换设置关键帧动画' ],
            [ '8.4', '8.4 布尔关键帧', '布尔关键帧动画实现闪烁的星球' ],
            [ '8.5', '8.5 颜色关键帧', '颜色关键帧动画实现各种材质颜色属性动画' ],
            [ '8.6', '8.6 数值关键帧', '数值关键帧动画' ],
            [ '8.7', '8.7 混合器', 'mixer混合器详解' ],
            [ '8.8', '8.8 动作切换', '人物多动作切换' ]
        ]
    ],
    [ '9', '九 粒子', '精通粒子特效',
        [
            [ '9.1', '9.1 Points与点材质', '初识Points与点材质' ],
            [ '9.2', '9.2 点材质属性', '深度解析点材质属性' ],
            [ '9.3', '9.3 顶点着色', '顶点着色应用绚丽多彩星空' ],
            [ '9.4', '9.4 雪花', '相机剪辑漫天雪花' ],
            [ '9.5', '9.5 旋臂星系', '使用数学方法实现复杂形状旋臂星系' ]
        ]
    ],
    [ '10', '十 光线投射与物体交互', '光线投射与物体交互',
        [
            [ '10.1', '10.1 投射光线交互', '投射光线实现三维物体交互' ]
        ]
    ],
    [ '11', '十一 3D全屏滚动', '3D全屏滚动官网',
        [
            [ '11.1', '11.1 3D滚动', '3D全屏滚动官网' ]
        ]
    ],
    [ '12', '十二 物理引擎', '物理引擎',
        [
            [ '12.2', '12.2 关联物体', 'cannon.js关联three.js物体' ],
            [ '12.3', '12.3 物体碰撞', '与平面碰撞' ],
            [ '12.4', '12.4 碰撞监听', '监听碰撞事件, 控制碰撞音效' ],
            [ '12.5', '12.5 摩擦与弹性系数', '关联材质设置摩擦与弹性系数' ],
            [ '12.6', '12.6 碰撞效果', '相互碰撞旋转' ],
            [ '12.7', '12.7 作用力', '物体施加作用力' ]
        ]
    ],
    [ '14', '十四 着色器', '着色器编程',
        [
            [ '14.1', '14.1 着色器语言', '认识着色器语言' ],
            [ '14.2', '14.2 着色器文件导入', '着色器插件与文件导入开发' ],
            [ '14.3', '14.3 原始着色器材质', 'rawShaderMaterial与attribute_uv' ],
            [ '14.4', '14.4 顶点位置', '控制顶点位置' ],
            [ '14.5', '14.5 时间动画', 'uniform传递时间变量实现动画与UV采样纹理' ],
            [ '14.6', '14.6 图案', '着色器编写给种类型图案' ],
            [ '14.7', '14.7 图案', '着色器编写给种类型图案' ],
            [ '14.8', '14.8 图案', '着色器编写给种类型图案' ],
            [ '14.9', '14.9 图案', '着色器编写给种类型图案' ],
            [ '14.10', '14.10 孔明灯', '孔明灯' ],
            [ '14.11', '14.11 孔明灯', '孔明灯' ]
        ]
    ],
    [ '15', '十五 着色器', '着色器烟雾水云效果',
        [
            [ '15.1', '15.1 烟雾水', '烟雾水代码准备' ],
            [ '15.2', '15.2 烟雾水', '着色器烟雾水云效果' ],
            [ '15.3', '15.3 烟雾水', '噪声参数' ],
            [ '15.4', '15.4 烟雾水', '流动' ],
            [ '15.5', '15.5 烟雾水', '波纹方向与速度' ],
            [ '15.6', '15.6 官方水模型', '官方水模型' ],
            [ '15.7', '15.7 泳池', 'Blender模型泳池' ]
        ]
    ],
    [ '16', '十六 着色器点材质', '着色器点材质',
        [
            [ '16.1', '16.1 基本设置', '基本设置' ],
            [ '16.2', '16.2 点着色器', '点着色器图形设置' ],
            [ '16.3', '16.3 点着色器纹理材质', '点着色器纹理材质' ],
            [ '16.4', '16.4 不同点的图案', 'Points中生成不同点图案' ],
            [ '16.5', '16.5 点大小', '点大小' ],
            [ '16.6', '16.6 顶点旋转', '顶点旋转' ],
            [ '16.7', '16.7 顶点渐变', '顶点渐变' ]
        ]
    ],
    [ '17', '十七 烟花', '烟花案例',
        [
            [ '17.1', '17.1 烟花', '烟花案例' ]
        ]
    ],
    [ '18', '十八 着色器材质', '着色器材质',
        [
            [ '18.1', '18.1 着色器材质应用', '着色器材质应用' ]
        ]
    ],
    [ '19', '十九 效果合成', '效果合成',
        [
            [ '19.1', '19.1 效果合成', '效果合成' ],
            [ '19.2', '19.2 效果合成', '效果合成' ]
        ]
    ],
    [ '20', '二十 HTML混合3D渲染', 'HTML混合3D渲染',
        [
            [ '20.1', '20.1 CSS渲染器', 'CSS渲染器基本使用' ],
            [ '20.2', '20.2 CSS渲染器', 'HTML跟随物体移动' ],
            [ '20.3', '20.3 CSS渲染器', '射线碰撞来检测标签显示隐藏' ]
        ]
    ],
    [ '21', '二十一 曲线与轨迹', '曲线应用与轨迹运动',
        [
            [ '21.1', '21.1 曲线', '曲线使用与绘制流程' ],
            [ '21.2', '21.2 轨迹', '物体与相机按曲线轨迹运动' ],
        ]
    ],
    [ '22', '二十二 变形动画', '变形动画',
        [
            [ '22.1', '22.1 变形原理', '变形动画原理与实现' ],
        ]
    ],
    [ '23', '二十三 全景看房', '全景看房与科技展馆',
        [
            [ '23.1', '23.1 VR全景看房', '原理与实现' ],
            [ '23.2', '23.2 VR全景看房', '房间切换' ],
            [ '23.3', '23.3 VR全景看房', '地图' ],
            [ '23.4', '23.4 VR全景看房', '进度' ],
            [ '23.6', '23.6 户型', '户型' ],
            [ '23.7', '23.6 户型', '墙体' ],
        ]
    ],
    [ '24', '二十四 智慧城市', '智慧城市',
        [
            [ '24', '24 智慧城市', '智慧城市' ],
        ]
    ],
    [ '33', '三十三 3D地图', '地理数据生成3D地图',
        [
            [ '33', '33 3D地图', '地理数据生成3D地图' ],
        ]
    ],
    [ '40', '四十 YuKa', 'AI寻路避障自动导航',
        [
            [ '40.1', '40.1 YuKa路径跟随', 'YuKa路径跟随' ]
        ]
    ]
];

const routeDefault = {
    path: __base__path__,
    name: __base__name__,
    meta: {
        title: '可视化企业实战'
    },
    redirect: { name: 'Home' },
    children: setChildren(__children__)
};

export default routeDefault;
